driver-tests/bpelse/while/WhileJbi/test/WhileIfElse13/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:def="http://www.mycomp.org/DefaultServiceName">
  <soapenv:Body>
    <def:IfMessage>If Message</def:IfMessage>
    <def:ElseMessage>Else Message</def:ElseMessage>
    <def:ElseIfMessage>ElseIf Message</def:ElseIfMessage>
    <def:counter>1</def:counter>
  </soapenv:Body>
</soapenv:Envelope>